rest_benchmark_lab/results/aiohttp_cpu_blocking.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        Python/3.13
Server Hostname:        127.0.0.1
Server Port:            8001

Document Path:          /high_cpu_endpoint
Document Length:        48 bytes

Concurrency Level:      10
Time taken for tests:   1.030 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      6210 bytes
HTML transferred:       1440 bytes
Requests per second:    29.12 [#/sec] (mean)
Time per request:       343.419 [ms] (mean)
Time per request:       34.342 [ms] (mean, across all concurrent requests)
Transfer rate:          5.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       2
Processing:    36  301 105.3    349     452
Waiting:       32  248  95.6    281     356
Total:         36  302 105.0    350     453

Percentage of the requests served within a certain time (ms)
  50%    350
  66%    351
  75%    353
  80%    353
  90%    356
  95%    452
  98%    453
  99%    453
 100%    453 (longest request)