rest_benchmark_lab/results/fastapi_cpu_fixed.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /high_cpu_endpoint_fixed
Document Length:        45 bytes

Concurrency Level:      10
Time taken for tests:   1.041 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      5100 bytes
HTML transferred:       1350 bytes
Requests per second:    28.82 [#/sec] (mean)
Time per request:       347.000 [ms] (mean)
Time per request:       34.700 [ms] (mean, across all concurrent requests)
Transfer rate:          4.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      0       2
Processing:    40  305  79.2    330     445
Waiting:       38  289  78.9    324     418
Total:         40  306  79.2    332     445
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%    332
  66%    332
  75%    338
  80%    347
  90%    378
  95%    412
  98%    445
  99%    445
 100%    445 (longest request)