rest_benchmark_lab/results/fastapi_slow_fixed.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /slow_endpoint_fixed
Document Length:        57 bytes

Concurrency Level:      20
Time taken for tests:   0.687 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      18200 bytes
HTML transferred:       5700 bytes
Requests per second:    145.65 [#/sec] (mean)
Time per request:       137.317 [ms] (mean)
Time per request:       6.866 [ms] (mean, across all concurrent requests)
Transfer rate:          25.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       4
Processing:   101  110  13.3    105     152
Waiting:      100  109  13.3    104     151
Total:        102  111  13.4    107     153

Percentage of the requests served within a certain time (ms)
  50%    107
  66%    109
  75%    110
  80%    111
  90%    114
  95%    152
  98%    153
  99%    153
 100%    153 (longest request)