rest_benchmark_lab/results/tornado_cpu_blocking.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        TornadoServer/6.5.6
Server Hostname:        127.0.0.1
Server Port:            8002

Document Path:          /high_cpu_endpoint
Document Length:        48 bytes

Concurrency Level:      10
Time taken for tests:   1.046 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7050 bytes
HTML transferred:       1440 bytes
Requests per second:    28.69 [#/sec] (mean)
Time per request:       348.595 [ms] (mean)
Time per request:       34.859 [ms] (mean, across all concurrent requests)
Transfer rate:          6.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       2
Processing:    35  285 100.5    334     365
Waiting:       35  285 100.6    334     365
Total:         37  286 100.0    335     366
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%    335
  66%    337
  75%    346
  80%    349
  90%    352
  95%    364
  98%    366
  99%    366
 100%    366 (longest request)